Revit 2020 API
Wave Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Wave
Visual Basic
Public NotInheritable Class Wave
Visual C++
public ref class Wave abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Wave
See Also
Wave Members
Autodesk.Revit.DB.Visual Namespace